---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExtensibleStorage.Entity
source: html/4e026b65-003e-40e1-f75c-f0a6eb29be5c.htm
---
# Entity Properties

Specifies whether the .NET object represents a valid Revit entity.